In [152]:
dict = {"C":"Three","A":"one","B":"Two"}

In [125]:
dict

{'C': 'Three', 'A': 'one', 'B': 'Two'}

In [126]:
dict['B'] = "TWO"

In [127]:
dict

{'C': 'Three', 'A': 'one', 'B': 'TWO'}

In [128]:
if dict["B"].isupper():
    print("True")
else:
    print("False")

True

In [129]:
dict.items()

dict_items([('C', 'Three'), ('A', 'one'), ('B', 'TWO')])

In [130]:
class a:
    def __init__(self,string):
        self.a = string

In [131]:
obj = a("maneesh")

In [132]:
dict[obj] = 'sum'

In [133]:
dict

{'C': 'Three', 'A': 'one', 'B': 'TWO', <__main__.a at 0x229d022d700>: 'sum'}

In [134]:
print(f"Hello {obj.a}")

Hello maneesh

In [135]:
lst = [3,7,4,6,0,1,2]

In [136]:
def sec_max(lst):
    c=0
    m=0
    for i in lst:
        if i>c:
            c=i
        if i>m and i<c:
            m=1
    return m

In [137]:
sec_max(lst)

1

In [138]:
data = {"col 1" : ["A","b","C"],
       "clo 2" : [1,2,3]}

In [139]:
import pandas as pd

In [140]:
df=pd.DataFrame(data)

In [141]:
df

  col 1  clo 2
0     A      1
1     b      2
2     C      3

In [142]:
df.iloc[2:3,1:2] = 5

In [143]:
df

  col 1  clo 2
0     A      1
1     b      2
2     C      5

In [144]:
import numpy as np

In [145]:
mat1=np.array([1,2,3,4])

In [146]:
mat1.reshape(2,2)

array([[1, 2],
       [3, 4]])

In [147]:
mat2=np.array([4,5,6,7])

In [148]:
mat2.reshape(2,2)

array([[4, 5],
       [6, 7]])

In [149]:
mat3=mat1*mat2

In [155]:
dict = {'C': 'Three', 'A': 'one', 'B': 'Two'}

In [169]:
df = pd.DataFrame(dict.items())

In [170]:
df

   0      1
0  C  Three
1  A    one
2  B    Two

In [171]:
df.to_csv("D:\R\ex.csv")

<>:1: SyntaxWarning: invalid escape sequence '\R'
<>:1: SyntaxWarning: invalid escape sequence '\R'
C:\Users\MA20306822\AppData\Local\Temp\ipykernel_12512\2026471574.py:1: SyntaxWarning: invalid escape sequence '\R'
  df.to_csv("D:\R\ex.csv")

In [69]:
try:
    dict.write_csv("D:\R\ex.csv")
except AttributeError:
    print("Some attribute error occured")

Some attribute error occured

<>:2: SyntaxWarning: invalid escape sequence '\R'
<>:2: SyntaxWarning: invalid escape sequence '\R'
C:\Users\MA20306822\AppData\Local\Temp\ipykernel_6056\2741878087.py:2: SyntaxWarning: invalid escape sequence '\R'
  dict.write_csv("D:\R\ex.csv")

In [81]:
lst=[3, 7, 4, 6, 0, 1, 2,8,9,0]

In [82]:
num = 0
sec = 0
for i in lst:
    if i>num:
        sec=num
        num= i
    elif i>sec and i!=num:
        sec = i

In [83]:
num

9

In [84]:
sec

8

In [1]:
from sklearn.datasets import load_iris

# Load the Iris dataset
iris = load_iris()

In [4]:
import pandas as pd

In [2]:
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n:Number of Instances: 150 (50 in each of three classes)\n:Number of Attributes: 4 numeric, predictive attributes and the class\n:Attribute Information:\n    - sepal length in cm\n    - sepal width in cm\n    - petal length in cm\n    - petal width in cm\n    - class:\n            - Iris-Setosa\n            - Iris-Versicolour\n            - Iris-Virginica\n\n:Summary Statistics:\n\n============== ==== ==== ======= ===== ====================\n                Min  Max   Mean    SD   Class Correlation\n============== ==== ==== ======= ===== ====================\nsepal length:   4.3  7.9   5.84   0.83    0.7826\nsepal width:    2.0  4.4   3.05   0.43   -0.4194\npetal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\npetal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n============== ==== ==== ======= ===== ====================\n\n:Missing Attribute Values: None\n:Class Distribution: 33.3% for each of 3 classes.\n:Creator: R.A. Fisher\n:Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n:Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n|details-start|\n**References**\n|details-split|\n\n- Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n  Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n  Mathematical Statistics" (John Wiley, NY, 1950).\n- Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n  (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n- Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n  Structure and Classification Rule for Recognition in Partially Exposed\n  Environments".  IEEE Transactions on Pattern Analysis and Machine\n  Intelligence, Vol. PAMI-2, No. 1, 67-71.\n- Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n  on Information Theory, May 1972, 431-433.\n- See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n  conceptual clustering system finds 3 classes in the data.\n- Many, many more ...\n\n|details-end|\n',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'iris.csv',
 'data_module': 'sklearn.datasets.data'}

In [6]:
df = pd.DataFrame(data=iris.data, columns=iris.feature_names)

In [7]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [9]:
df["species"] = iris.target

In [10]:
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [14]:
df.iloc[149,0]

5.9

SyntaxError: invalid syntax. Perhaps you forgot a comma? (4231115058.py, line 1)

In [20]:
df.loc[0:4, 'sepal length (cm)':"species"]

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [21]:
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [37]:
df.iloc[148:150,0:5]

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [38]:
df.loc[148:149,"sepal length (cm)":"species"]

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [41]:
dict = {"A":"two",(1,2,3,4):7,"B":(1,2,3) }

In [42]:
dict

{'A': 'two', (1, 2, 3, 4): 7, 'B': (1, 2, 3)}

In [43]:
dict.keys()

dict_keys(['A', (1, 2, 3, 4), 'B'])

In [44]:
dict.values()

dict_values(['two', 7, (1, 2, 3)])

In [51]:
dict["c"] = [7,8,9,5]

In [54]:
dict["c"][1]=10

In [55]:
dict

{'A': 'two', (1, 2, 3, 4): 7, 'B': (1, 2, 3), 'c': [7, 10, 9, 5]}

In [56]:
import numpy as np

# Define two arrays (vectors)
arr1 = np.array([1, 2, 3])
arr2 = np.array([4, 5, 6])

# Dot product
dot_product_result = np.dot(arr1, arr2)

print("Dot product:")
print(dot_product_result)

Dot product:
32

In [57]:
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [58]:
df.isnull()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,False,False,False,False,False
1,False,False,False,False,False
2,False,False,False,False,False
3,False,False,False,False,False
4,False,False,False,False,False
...,...,...,...,...,...
145,False,False,False,False,False
146,False,False,False,False,False
147,False,False,False,False,False
148,False,False,False,False,False
149,False,False,False,False,False

In [61]:
df.isnull().sum()

sepal length (cm)    0
sepal width (cm)     0
petal length (cm)    0
petal width (cm)     0
species              0
dtype: int64

In [63]:
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [64]:
df = pd.read_csv("D:\\titanic.csv")

In [65]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [69]:
df.groupby(["Sex",'Survived',"Pclass"])["Fare"].sum()

Sex     Survived  Pclass
female  0         1          331.8125
                  2          109.5000
                  3         1423.6627
        1         1         9644.0125
                  2         1560.2292
                  3          897.4459
male    0         1         4842.9081
                  2         1773.4958
                  3         3661.3408
        1         1         3358.6794
                  2          358.6167
                  3          732.2457
Name: Fare, dtype: float64

In [75]:
s=pd.Series([1,2,3,4,5],["A","B","C","D","E"])

In [76]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [81]:
dict

{'A': 'two', (1, 2, 3, 4): 7, 'B': (1, 2, 3), 'c': [7, 10, 9, 5]}

In [82]:
d=s=pd.Series(dict)

In [83]:
d

A                         two
(1, 2, 3, 4)                7
B                   (1, 2, 3)
c               [7, 10, 9, 5]
dtype: object

In [84]:
a=np.array([1,2,3,4])

In [85]:
b=np.array([1,2,3,4])

In [86]:
a+b

array([2, 4, 6, 8])

In [87]:
a-b

array([0, 0, 0, 0])

In [88]:
a*b

array([ 1,  4,  9, 16])

In [89]:
a/b

array([1., 1., 1., 1.])

In [90]:
a@b

30

In [91]:
a=np.array([1,2,3,4]).reshape(2,2)

In [97]:
b=np.array([1,2,3,4]).reshape(2,2)

In [98]:
a

array([[1, 2],
       [3, 4]])

In [99]:
b

array([[1, 2],
       [3, 4]])

In [100]:
a+b

array([[2, 4],
       [6, 8]])

In [101]:
a-b

array([[0, 0],
       [0, 0]])

In [102]:
a*b

array([[ 1,  4],
       [ 9, 16]])

In [103]:
a@b

array([[ 7, 10],
       [15, 22]])

In [105]:
a=np.array([1,2,3,4,5,6]).reshape(2,3)

In [106]:
a

array([[1, 2, 3],
       [4, 5, 6]])

In [112]:
b=np.array([1,2,3,4,5,6]).reshape(3,2)

In [113]:
b

array([[1, 2],
       [3, 4],
       [5, 6]])

In [114]:
a+b

ValueError: operands could not be broadcast together with shapes (2,3) (3,2)

In [115]:
a-b

ValueError: operands could not be broadcast together with shapes (2,3) (3,2)

In [116]:
a*b

ValueError: operands could not be broadcast together with shapes (2,3) (3,2)

In [117]:
a@b

array([[22, 28],
       [49, 64]])

In [118]:
import numpy as np

# Define a 3x3 matrix
A = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

# Define a 1D array
B = np.array([10, 20, 30])

# Perform element-wise multiplication
result = A * B

print("Result:")
print(result)

Result:
[[ 10  40  90]
 [ 40 100 180]
 [ 70 160 270]]

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\\titanic.csv")

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.to_csv("D:\\titanic1.csv",index=False)

In [12]:
df.to_excel("D:\\titanic2.xlsx")

In [13]:
df.to_json("D:\\titanic2.json")

In [14]:
df1=pd.read_csv("D:\\titanic1.csv")

In [15]:
df2=pd.read_excel("D:\\titanic2.xlsx")

In [16]:
df3=pd.read_json("D:\\titanic2.json")

In [17]:
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
df2

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
df3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [20]:
df1.to_csv("D:\\titanic1.csv")

In [21]:
df1.to_excel("D:\\titanic2.xlsx")

In [22]:
df1.to_json("D:\\titanic1.json")

In [29]:
try:
    dict.write_csv("D:\\titanic1.json")
except AttributeError as e:
    print(e)

else :
    print("No error")
finally:
    print("Finally Block")

type object 'dict' has no attribute 'write_csv'
Finally Block

In [30]:
import numpy as np

In [37]:
a=np.array([[1,2,3,4],[5,6,7,8]])

In [39]:
a.shape

(2, 4)

In [40]:
type(a)

numpy.ndarray

In [41]:
m = np.random.randint(10,20,size=(3,3))

In [43]:
n = np.random.randint(10,20,size=(3,3))

In [46]:
print(n)
m

[[19 10 16]
 [19 17 19]
 [16 11 15]]

array([[18, 19, 17],
       [15, 12, 12],
       [14, 12, 10]])

In [47]:
m+n

array([[37, 29, 33],
       [34, 29, 31],
       [30, 23, 25]])

In [48]:
m-n

array([[-1,  9,  1],
       [-4, -5, -7],
       [-2,  1, -5]])

In [49]:
m*n

array([[342, 190, 272],
       [285, 204, 228],
       [224, 132, 150]])

In [50]:
m/n

array([[0.94736842, 1.9       , 1.0625    ],
       [0.78947368, 0.70588235, 0.63157895],
       [0.875     , 1.09090909, 0.66666667]])

In [51]:
m@n

array([[975, 690, 904],
       [705, 486, 648],
       [654, 454, 602]])

In [83]:
s=np.random.randint(1,30)

In [84]:
s

25